#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`Success! The configuration is valid.

`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```


module.kubernetes.module.infinity-gauntlet.module.nodes.module.netboot.minio_s3_object.txt_file: Refreshing state... [id=text.txt]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_s3_bucket.bucket["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_s3_bucket.bucket["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd]
module.synology.module.minio.minio_iam_user.user["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn]
module.synology.module.minio.minio_iam_user.user["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88]
module.synology.module.minio.minio_iam_policy.policy_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4]
module.synology.module.minio.minio_iam_policy.policy["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4]
module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4]
module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20210927074033997800000002]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20210927074033997800000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20210927074033995900000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"]: Refreshing state... [id=state-infinity-gauntlet-longhorn-20210927073647959200000003]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"]: Refreshing state... [id=tftp-netboot-infinity-gauntlet-20210927073647958000000001]
module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"]: Refreshing state... [id=state-infinity-gauntlet-etcd-20210927073647958000000002]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88"
        name   = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-etcd",
                            "arn:aws:s3:::state-infinity-gauntlet-etcd/*",
                          + "arn:aws:s3:::state-infinity-gauntlet-etcd",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_policy" "policy" {
        id     = "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe"
        name   = "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Resource = [
                          - "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                            "arn:aws:s3:::state-infinity-gauntlet-longhorn",
                          + "arn:aws:s3:::state-infinity-gauntlet-longhorn/*",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_policy.policy_global["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_policy" "policy_global" {
        id     = "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4"
        name   = "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:ListAllMyBuckets",
                            "s3:GetBucketLocation",
                          + "s3:ListAllMyBuckets",
                        ]
                        # (2 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment" {
        id          = "state-infinity-gauntlet-longhorn-20210927073647959200000003"
      ~ policy_name = "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe" -> "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "state-infinity-gauntlet-etcd-20210927073647958000000002"
      ~ policy_name = "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4" -> "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88"
        # (1 unchanged attribute hidden)
    }
  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] has been changed
  ~ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
        id          = "tftp-netboot-infinity-gauntlet-20210927073647958000000001"
      ~ policy_name = "tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4" -> "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf"
        # (1 unchanged attribute hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.github.github_repository.example will be created
  + resource "github_repository" "example" {
      + allow_merge_commit     = true
      + allow_rebase_merge     = true
      + allow_squash_merge     = true
      + archived               = false
      + default_branch         = (known after apply)
      + delete_branch_on_merge = false
      + description            = (known after apply)
      + etag                   = (known after apply)
      + full_name              = (known after apply)
      + git_clone_url          = (known after apply)
      + html_url               = (known after apply)
      + http_clone_url         = (known after apply)
      + id                     = (known after apply)
      + name                   = "terraform-example"
      + node_id                = (known after apply)
      + private                = (known after apply)
      + repo_id                = (known after apply)
      + ssh_clone_url          = (known after apply)
      + svn_url                = (known after apply)
      + visibility             = "public"
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment["state_infinity_gauntlet_longhorn"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment" {
      ~ id          = "state-infinity-gauntlet-longhorn-20210927073647959200000003" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-longhorn-335be9c5595a4d85e1bf191c172718e4" -> "state-infinity-gauntlet-longhorn-954ebc35ecca52a899c98bdd9c1762fe" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["state_infinity_gauntlet_etcd"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "state-infinity-gauntlet-etcd-20210927073647958000000002" -> (known after apply)
      ~ policy_name = "state-infinity-gauntlet-etcd-705433c3614c5093ab5aabd268719e88" -> "state-infinity-gauntlet-etcd-335be9c5595a4d85e1bf191c172718e4" # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.synology.module.minio.minio_iam_user_policy_attachment.policy_attachment_global["tftp_netboot_infinity_gauntlet"] must be replaced
-/+ resource "minio_iam_user_policy_attachment" "policy_attachment_global" {
      ~ id          = "tftp-netboot-infinity-gauntlet-20210927073647958000000001" -> (known after apply)
      ~ policy_name = "tftp-netboot-infinity-gauntlet-03c3c71cc85e3193397f03bdcc2c24cf" -> "tftp-netboot-infinity-gauntlet-335be9c5595a4d85e1bf191c172718e4" # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 4 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>